RhinoInside.Revit API Documentation
GeometryDecoder.ToPolyCurves Method
 Converts the specified CurveArrArray to an equivalent PolyCurve array.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8016
Syntax
public static PolyCurve[] ToPolyCurves(
	this CurveArrArray value
)
Parameters
value
Type: CurveArrArray
A value to convert.
Return Value
Type: PolyCurve[]
A Rhino PolyCurve array that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type CurveArrArray. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace